### 2016.01.09

In [3]:
import pandas as pd

In [ ]:
# 결측치 처리

# 데이터프레임 생성
data = {'Name': ['Alice', 'Bob', None],
'Age': [25, None, 30],
'Score': [85, 90, None]}

df = pd.DataFrame(data)

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    2 non-null      object
 1   Age     2 non-null      float64
 2   Score   2 non-null      float64
dtypes: float64(2), object(1)
memory usage: 204.0+ bytes

In [6]:
df.isnull()
df

    Name   Age  Score
0  Alice  25.0   85.0
1    Bob   NaN   90.0
2   None  30.0    NaN

In [10]:
# 결측치가 있는 행을 제거

df_missing_rows = df.dropna()
print(df_missing_rows)
print('-'*30)
df_missing_cols = df.dropna(axis = 1)
print(df_missing_cols)

    Name   Age  Score
0  Alice  25.0   85.0
------------------------------
Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [18]:
# 결측치에 값을 대체
# Name: 최빈값
df['Name'] = df['Name'].fillna(df['Name'].mode()[0])
# Age:평균값
df['Age'] = df['Age'].fillna(df['Age'].mean())
# Score: 중앙값
df['Score'] = df['Score'].fillna(df['Score'].median())


df

    Name   Age  Score
0  Alice  25.0   85.0
1    Bob  27.5   90.0
2  Alice  30.0   87.5

In [20]:
# 이상치 처리

data = {
    'score' : [70, 75, 80, 85, 90, 150]
}

df = pd.DataFrame(data)
df

   score
0     70
1     75
2     80
3     85
4     90
5    150

In [22]:
#IQR

Q1 = df['score'].quantile(0.25)
Q3 = df['score'].quantile(0.75)

IQR = Q3 - Q1
print(Q1, Q3, IQR)

76.25 88.75 12.5

In [24]:
# 이상치의 범위

low_ = Q1 - 1.5*IQR
up_ = Q3 + 1.5*IQR

print(f'이상치의 범위 : {low_}보다 작은 값, {up_}값조다 큰 값')

이상치의 범위 : 57.5보다 작은 값, 107.5값조다 큰 값

In [30]:
# 이상치 찾기

df_1 = df[(df['score']<low_) | (df['score']>up_)]
df_1

   score
5    150

In [32]:
df_2 = df[(df['score'] >= low_) & (df['score'] <= up_)]
df_2

   score
0     70
1     75
2     80
3     85
4     90

In [33]:
# 이상치 데이터 변경
df['score'] = df['score'].astype(float)
df.loc[df['score']<low_, 'score'] = low_
df.loc[df['score']>up_, 'score'] = up_

df

   score
0   70.0
1   75.0
2   80.0
3   85.0
4   90.0
5  107.5

In [ ]:
# 중복데이터 처리 : 확인 -> 제거

data = {'Name': ['Alice', 'Bob', 'Alice', 'Charlie', 'Bob'],
'Age': [25, 30, 25, 35, 30],
'Score': [85, 90, 85, 95, 90]}
df = pd.DataFrame(data)

print('원본 데이터프레임:')
print(df)

원본 데이터프레임:
      Name  Age  Score
0    Alice   25     85
1      Bob   30     90
2    Alice   25     85
3  Charlie   35     95
4      Bob   30     90

In [36]:
# 중복 데이터를 모두 삭제

df_1 = df.drop_duplicates(keep=False)
df_1

      Name  Age  Score
3  Charlie   35     95

In [38]:
df_1 = df.drop_duplicates(keep='last')
df_1

      Name  Age  Score
2    Alice   25     85
3  Charlie   35     95
4      Bob   30     90

In [ ]:
# 특정 열의 값을 기준으로 중복된 행을 삭제

df_2 = df.drop_duplicates(subset=['Name'], keep='last')
df_2

      Name  Age  Score
2    Alice   25     85
3  Charlie   35     95
4      Bob   30     90

In [6]:
import pandas as pd
from sklearn.preprocessing import StandardScaler, MinMaxScaler, LabelEncoder, OneHotEncoder

In [8]:
import pandas as pd

data1 = pd.DataFrame(
    {
        'original': [50, 90, 90, 100, 160]

    }
)

data2 =pd.DataFrame(
    {
        'Fruits': ['사과', '배', '포도', '사과', '포도']

    }
)

In [12]:
# 표준화
scaler_1 = StandardScaler()
data1['scale_1'] = scaler_1.fit_transform(data1[['original']])

# 정규화
scaler_2 = MinMaxScaler()
data1['scale_2'] = scaler_2.fit_transform(data1[['original']])

In [13]:
data1

   original   scale_1   scale_2
0        50 -1.354398  0.000000
1        90 -0.225733  0.363636
2        90 -0.225733  0.363636
3       100  0.056433  0.454545
4       160  1.749431  1.000000

In [17]:
encoder_1 = LabelEncoder()
data2['Label Encoding'] = encoder_1.fit_transform(data2['Fruits'])
print(data2)

  Fruits  Label Encoding
0     사과               1
1      배               0
2     포도               2
3     사과               1
4     포도               2

In [30]:
encoder_2 = OneHotEncoder(sparse_output=False)
onehot_encoding = encoder_2.fit_transform(data2[['Fruits']])
onehot_col = encoder_2.get_feature_names_out()
print(onehot_encoding)
print(onehot_col)

[[0. 1. 0.]
 [1. 0. 0.]
 [0. 0. 1.]
 [0. 1. 0.]
 [0. 0. 1.]]
['Fruits_배' 'Fruits_사과' 'Fruits_포도']

In [31]:
onehot_df = pd.DataFrame(
    onehot_encoding,
    columns=onehot_col,
    #index=data2.index  # ← 행 개수(5개)랑 맞춰야 함
)

onehot_df

   Fruits_배  Fruits_사과  Fruits_포도
0       0.0        1.0        0.0
1       1.0        0.0        0.0
2       0.0        0.0        1.0
3       0.0        1.0        0.0
4       0.0        0.0        1.0

In [34]:
# merge : 열단위 데이터 병합 => 옆으로 붙인다!!!

import pandas as pd

# 고객 정보 데이터프레임
customers = pd.DataFrame({
'customer_id': [1, 2, 3],
'name': ['Alice', 'Bob', 'Charlie']
})
# 주문 정보 데이터프레임
orders = pd.DataFrame({
'order_id': [101, 102, 103],
'customer_id': [1, 2, 4],
'product': ['Laptop', 'Tablet', 'Smartphone']
})

In [40]:
# 공통된 customer_id 데이터를 병합 : Inner.Join 
result1 = pd.merge(customers, orders, on = 'customer_id', how = 'inner') # 순서 중요
print(result1)

   customer_id   name  order_id product
0            1  Alice       101  Laptop
1            2    Bob       102  Tablet

In [44]:
# 고객별 주문 내역 : 구매 이력이 없는 고객도 표현

result2 = pd.merge(customers, orders, on = 'customer_id', how = 'left' )
print(result2)

   customer_id     name  order_id product
0            1    Alice     101.0  Laptop
1            2      Bob     102.0  Tablet
2            3  Charlie       NaN     NaN